# AnalysisDisplayStyleId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisResultSchema..::..AnalysisDisplayStyleId Property
AnalysisResultSchema Class See Also
---
ElementId of analysis display style overriding the style set for view; -1 if the style is not overridden
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId AnalysisDisplayStyleId { get; set; }
```

Visual Basic
---
```text
Public Property AnalysisDisplayStyleId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ AnalysisDisplayStyleId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace